blog-posts/2007-12-16-outline-for-task-management-chapter.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Outline for task management chapter</title>
<!-- 2015-01-07 Wed 14:49 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Outline for task management chapter</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Why manage your tasks in Emacs</a></li>
<li><a href="#sec-2">Strategies for task management</a></li>
<li><a href="#sec-3">Choosing a task manager</a></li>
<li><a href="#sec-4">Org</a></li>
<li><a href="#sec-5">Planner</a></li>
<li><a href="#sec-6">Wrapping up</a></li>
</ul>
</div>
</div>
<p>
December 16th, 2007 -
<a href="http://sachachua.com/blog/p/4513"><a href="http://sachachua.com/blog/p/4513">http://sachachua.com/blog/p/4513</a></a>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Why manage your tasks in Emacs</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
- [ ] What you might be using now
  - [ ] Your brain
  - [ ] Paper
  - [ ] A text file
  - [ ] A sophisticated task management system
- [ ] The power of customization (tell a story)
- [ ] Integrating with your non-Emacs life
</pre>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Strategies for task management</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
- [ ] Top-down
- [ ] Bottom-up
- [ ] Combining both strategies
- [ ] The daily and weekly reviews
</pre>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Choosing a task manager</h2>
<div class="outline-text-2" id="text-3">
<pre class="example">
- [ ] Outline-oriented planning, dynamic views
- [ ] Day orientation, more flexibility in prioritizing individual tasks, publishing, sharing additional information
</pre>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Org</h2>
<div class="outline-text-2" id="text-4">
<pre class="example">
- [ ] A day in the life
- [ ] The basics
  - [ ] Working with tasks
  - [ ] Viewing your task list
  - [ ] Prioritizing tasks
  - [ ] Scheduling tasks
  - [ ] Viewing your agenda
  - [ ] Marking a task as done
  - [ ] Weekly reviews
- [ ] Intermediate topics
  - [ ] Clocking time
  - [ ] Repeating tasks
  - [ ] Working with projects
  - [ ] Working with tags
- [ ] Advanced stuff
  - [ ] Managing multiple identities
  - [ ] Estimating your time
  - [ ] Publishing your task list
    - [ ] Twitter task updates
    - [ ] Daily task list
    - [ ] Project summary
</pre>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Planner</h2>
<div class="outline-text-2" id="text-5">
<pre class="example">
- [ ] A day in the life
- [ ] The basics
  - [ ] Working with tasks
  - [ ] Viewing your task list for the day
  - [ ] Prioritizing tasks
  - [ ] Scheduling tasks
  - [ ] Marking a task as done
  - [ ] Weekly reviews
- [ ] Intermediate topics
  - [ ] Clocking time
  - [ ] Working with plan pages
  - [ ] Task overviews
  - [ ] Repeating tasks
- [ ] Advanced stuff
  - [ ] Estimating your time
  - [ ] Publishing your task list
    - [ ] Private information in your tasks
    - [ ] Twitter task updates
    - [ ] Daily task list
    - [ ] Project summary
</pre>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Wrapping up</h2>
<div class="outline-text-2" id="text-6">
<p>
On Technorati: <a href="http://www.technorati.com/tag/book">book</a>,
<a href="http://www.technorati.com/tag/wickedcoolemacs">wickedcoolemacs</a>,
<a href="http://www.technorati.com/tag/emacs">emacs</a>
</p>

<p>
Random Emacs symbol: appt-display-format &#x2013; Variable: How appointment
reminders should be displayed.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
